{"pages":[{"title":"About Me","text":"I'm a software engineer working at the Green Bank Observatory , where I help people look at space. And sometimes I make websites (but not that one). Projects In my free time I like to build things. I've found a lot of great resources along the way; hopefully this will prove useful to someone at some point. All of the content here is free , and I'm trying to focus on reproducibility for each of my build logs. Every one of my projects is prototyped in a CAD program (currently SketchUp, but that could change), and I'll be providing the models alongside or in advance of the build log.","tags":"pages","url":"https://thomaschamberlin.com/pages/about.html"},{"title":"Toolbox","text":"Software Construction Software used in my construction endeavors: SketchUp : I use this for all of my modeling/prototyping. It's quick, easy, and free Kerkythea : I use this for rendering the images I post up. Really no idea what I'm doing still, but it does the job Website Software used to build this website: Pelican : This is a static site generator; I use it to build this website. Super straightforward to use Visual Studio Code : I recently switched over from Sublime Text and I've been quite happy so far Hardware I know it sucks looking at a build log that doesn't tell you what tools were used, so here it is. You really don't need much: Ridgid Impact Driver R86036K Bosch Jigsaw JS470E Bosch Random Orbit Sander ROS20VSC","tags":"pages","url":"https://thomaschamberlin.com/pages/toolbox.html"},{"title":"Couch","text":"I currently have a home theater setup in my living room. However, the room is not well-suited for it at all, so it's been quite the endeavor. I have one wall covered by the screen, another covered by windows, and another angled awkwardly in relation to the screen. That leaves the back wall for viewing movies. Currently I have two couches along the back wall, each angled across a corner there. But they don't really fit very well and it leaves a lot of wasted space behind them. So, I'd like to build a couch that covers the entirety of the back wall. Additionally I'd like to place a second couch along the \"awkward viewing\" wall, but be able to relocate it in order to watch movies. This means I'll need to loft the back couch -- sort of like stadium seating. Still in the planning phases of this, but I think I can attach the legs of the back couch on axles so that it can be lofted up/down when needed. More images incoming shortly, but this should give a general idea at least: As always, here's the model. Click on this to view it interactively. It can also be downloaded and examined more closely in SketchUp, if you're into that sort of thing:","tags":"Projects","url":"https://thomaschamberlin.com/couch.html"},{"title":"Rocking Chair","text":"First attempt at a rocking chair design! Here it is, complete with our favorite creepy dude (for scale): And here it is, blissfully in his absence: Based on these ergonomic guidelines I found, I went with a 5° seat angle, 10° back angle. and this information on rocker radius sizing . (with respect to vertical). I avoided fancy angles here since it is the first draft. In the future I might have the seat/rockers taper towards the back -- not sure if there's an actual purpose to that other than aesthetics. As always, here's the model. Click on this to view it interactively. It can also be downloaded and examined more closely in SketchUp, if you're into that sort of thing:","tags":"Projects","url":"https://thomaschamberlin.com/rocking-chair.html"},{"title":"Picnic Table","text":"Planning phase is complete, I think! Haven't actually started on this one yet, but I have it modeled out. Here it is with eight creepy dudes all staring at each other (for scale): Click on this to view it interactively. It can also be downloaded and examined more closely in SketchUp, if you're into that sort of thing:","tags":"Projects","url":"https://thomaschamberlin.com/picnic-table.html"},{"title":"Hammock Stand v2","text":"This is my second attempt at a hammock stand. Like the first , it will hold three hammocks, but this resolves a few issues that I've had with the first one since getting it built: This iteration will be significantly larger, due to issues hanging the hammocks adequately high in the first iteration. I'll be using higher-quality wood, too -- the first one was done with construction pine and I'll need to paint it if I want it to last outdoors. I'm hoping to pick up some sort of hardwood that is more durable and stain it this go-round. I don't think I'll actually end up using the eye lags to hang the hammock; the ones I'd feel comfortable using are really expensive. I'll just using webbing again -- cheap, durable, and doesn't permanently alter the structure. Click on this to view it interactively. It can also be downloaded and examined more closely in SketchUp, if you're into that sort of thing:","tags":"Projects","url":"https://thomaschamberlin.com/hammock-stand-v2.html"},{"title":"Indoor Garden v2","text":"I got started with the indoor garden a little over a year ago. I'll make a post about that at some point soon, but I'll need to dig up the pictures. Below is the plan for the next iteration. I currently have the three benches and the vertical H-frame built; pictures coming soon. The rest is awaiting the next burst of motivation...","tags":"Projects","url":"https://thomaschamberlin.com/indoor-garden.html"},{"title":"Hammock Stand v1","text":"I built a hammock stand! I was inspired by the ENOpod, but it's $500 for some reason. So I decided to make one out of wood instead. As with all new projects I drafted this out in SketchUp prior to building it. In this case it was essential, because calculating the funky angles would have been miserable by hand. Hadn't done double-angled cuts before, so that was fun to learn. It ended up coming out way too short due to some bad assumptions in the modeling phase. So it does work, but it's not ideal -- hammocks need to be a little too flat, which means it isn't as comfortable as it could be. Still awesome, but in the next iteration I'll fix this. Another side effect of the shortness is that the webbing (purple bits) connecting the hammock carabiners to the frame have to be tied in an awkward location. When weight is applied they end up getting shoved down into the gap between the top of the frame and the brace there, which pulls it apart a bit -- not good. As always, here's the model. Click on this to view it interactively. It can also be downloaded and examined more closely in SketchUp, if you're into that sort of thing:","tags":"Projects","url":"https://thomaschamberlin.com/hammock-stand-v1.html"}]}